Repository: mekobeko2222/bubbles-ecommerce-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Bubbles E-commerce App
ar: تطبيق فقاعات للتجارة الإلكترونية

# homeScreenTitle
source: Bubbles E-commerce
ar: فقاعات للتجارة الإلكترونية

# myBasketTitle
source: My Basket
ar: سلة المشتريات

# checkoutTitle
source: Checkout
ar: الدفع

# orderConfirmedTitle
source: Order Confirmed!
ar: تم تأكيد الطلب!

# myOrdersTitle
source: My Orders
ar: طلباتي

# userProfileTitle
source: User Profile
ar: ملف المستخدم

# aboutUsTitle
source: About Us
ar: من نحن

# adminPanelTitle
source: Admin Panel
ar: لوحة تحكم المسؤول

source: Continue Shopping
ar: متابعة التسوق

source: Total Price
ar: السعر الإجمالي

source: Subtotal
ar: المجموع الفرعي

source: Shipping Fee
ar: رسوم الشحن

source: Grand Total
ar: المجموع الكلي

source: Place Order
ar: إتمام الطلب

source: Add to Basket
ar: أضف إلى السلة

source: Out of Stock
ar: نفدت الكمية

source: Related Products
ar: منتجات ذات صلة

source: Description
ar: الوصف

source: Availability
ar: التوفر

# inStock
source: In Stock ({quantity})
ar: متوفر ({quantity})

source: Quantity
ar: الكمية

# pricePerItem
source: EGP {price} per item
ar: {price} جنيه مصري للقطعة

# totalItemPrice
source: Total: EGP {totalPrice}
ar: الإجمالي: {totalPrice} جنيه مصري

source: Email
ar: البريد الإلكتروني

source: Display Name
ar: اسم العرض

source: Default Shipping Address
ar: عنوان الشحن الافتراضي

source: Shipping Area
ar: منطقة الشحن

source: Building Number
ar: رقم المبنى

source: Floor Number
ar: رقم الطابق

source: Apartment Number
ar: رقم الشقة

source: Phone Number
ar: رقم الهاتف

source: Save Changes
ar: حفظ التغييرات

source: Change Password
ar: تغيير كلمة المرور

source: Loading data...
ar: جاري تحميل البيانات...

# errorLoadingData
source: Error loading data: {error}
ar: خطأ في تحميل البيانات: {error}

source: No data found.
ar: لا توجد بيانات.

source: Product Name
ar: اسم المنتج

source: Price
ar: السعر

source: Discount (%)
ar: الخصم (%)

source: Quantity in Stock
ar: الكمية في المخزون

source: Product Description
ar: وصف المنتج

# tags
source: Tags (comma-separated for related products)
ar: الكلمات الدلالية (مفصولة بفاصلة للمنتجات ذات الصلة)

source: Add Product Images
ar: أضف صور المنتج

# addMoreImages
source: Add more images ({current}/{max})
ar: أضف المزيد من الصور ({current}/{max})

source: Select Category
ar: اختر الفئة

# addCategory
source: Add New Category
ar: أضف فئة جديدة

source: Category Name
ar: اسم الفئة

# categoryIcon
source: Category Icon (emoji)
ar: أيقونة الفئة (رمز تعبيري)

source: Add Product
ar: أضف منتج

source: Manage Products
ar: إدارة المنتجات

source: Manage Areas
ar: إدارة المناطق

source: Orders
ar: الطلبات

source: Analytics
ar: التحليلات

source: Add New Shipping Area
ar: أضف منطقة شحن جديدة

source: Area Name
ar: اسم المنطقة

source: Add Area
ar: أضف منطقة

# shippingFeeAmount
source: Shipping Fee
ar: رسوم الشحن

source: Total Orders
ar: إجمالي الطلبات

source: Total Sales
ar: إجمالي المبيعات

source: Orders by Status
ar: الطلبات حسب الحالة

source: Order ID
ar: معرف الطلب

source: User Email
ar: بريد المستخدم الإلكتروني

source: Status
ar: الحالة

source: Order Date
ar: تاريخ الطلب

source: Update Status
ar: تحديث الحالة

source: Reorder
ar: إعادة الطلب

source: Cancel Order
ar: إلغاء الطلب

# loadingOrders
source: Loading your orders...
ar: جاري تحميل طلباتك...

source: Error loading orders
ar: خطأ في تحميل الطلبات

source: No orders yet
ar: لا توجد طلبات بعد

# orderHistoryWillAppearHere
source: Your order history will appear here
ar: سجل طلباتك سيظهر هنا

# cannotReorderEmptyList
source: Cannot reorder empty list of items.
ar: لا يمكن إعادة طلب قائمة فارغة من العناصر.

source: Adding items to basket...
ar: جاري إضافة العناصر إلى السلة...

# uniqueItemsAddedToBasket
source: {count} unique items added to your basket!
ar: تمت إضافة {count} عناصر فريدة إلى سلة المشتريات!

source: View
ar: عرض

source: Search products...
ar: البحث عن المنتجات...

source: Search Results
ar: نتائج البحث

source: Products on Offer
ar: منتجات معروضة للبيع

# noProductsFound
source: No products found for "{query}".
ar: لم يتم العثور على منتجات لـ "{query}".

source: No offers found.
ar: لا توجد عروض.

source: Shop by Category
ar: تسوق حسب الفئة

source: Unavailable
ar: غير متاح

source: Contact Us
ar: اتصل بنا

source: Our Mission
ar: مهمتنا

source: What We Offer
ar: ما نقدمه

source: Secure Checkout
ar: دفع آمن

source: Real-time Order Tracking
ar: تتبع الطلبات في الوقت الفعلي

source: Diverse Product Catalog
ar: كتالوج منتجات متنوع

source: Easy Navigation
ar: سهولة التصفح

# allRightsReserved
source: © 2024 Bubbles E-commerce. All rights reserved.
ar: © 2024 فقاعات للتجارة الإلكترونية. جميع الحقوق محفوظة.

source: Thank you for your order!
ar: شكراً لطلبك!

# orderPlacedSuccessfully
source: Your order has been placed successfully.
ar: تم تقديم طلبك بنجاح.

source: Order Details:
ar: تفاصيل الطلب:

source: Shipping Address:
ar: عنوان الشحن:

# imageLoadingError
source: Error loading image for {itemName} ({imageUrl}): {error}
ar: خطأ في تحميل الصورة لـ {itemName} ({imageUrl}): {error}

source: Order item image not supported
ar: صورة عنصر الطلب غير مدعومة

source: Order cannot be cancelled
ar: لا يمكن إلغاء الطلب

# orderCurrently
source: This order is currently "{status}" and cannot be cancelled by you. Please contact customer support if you need further assistance.
ar: هذا الطلب حاليًا "{status}" ولا يمكن إلغاؤه من قبلك. يرجى الاتصال بدعم العملاء إذا كنت بحاجة إلى مزيد من المساعدة.

source: Confirm Deletion
ar: تأكيد الحذف

# areYouSureDeleteProduct
source: Are you sure you want to delete "{productName}"? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف "{productName}"؟ لا يمكن التراجع عن هذا الإجراء.

source: Delete
ar: حذف

source: Cancel
ar: إلغاء

# cloudinaryUploadFailed
source: Cloudinary upload failed: {statusCode}. Check Cloudinary Console.
ar: فشل تحميل Cloudinary: {statusCode}. تحقق من وحدة تحكم Cloudinary.

# failedToUploadImage
source: Failed to upload image: {error}. Check internet/credentials.
ar: فشل تحميل الصورة: {error}. تحقق من الإنترنت/بيانات الاعتماد.

source: Product added successfully!
ar: تمت إضافة المنتج بنجاح!

# enterValidNumbers
source: Please enter valid numbers for price, discount, and quantity.
ar: الرجاء إدخال أرقام صحيحة للسعر والخصم والكمية.

# failedToAddProduct
source: Failed to add product: {error}
ar: فشل إضافة المنتج: {error}

source: Category name cannot be empty.
ar: لا يمكن أن يكون اسم الفئة فارغًا.

source: Category icon cannot be empty.
ar: لا يمكن أن تكون أيقونة الفئة فارغة.

# categoryAdded
source: Category "{categoryName}" added!
ar: تمت إضافة الفئة "{categoryName}"!

# failedToAddCategory
source: Failed to add category: {error}
ar: فشل إضافة الفئة: {error}

# noCategoriesAvailable
source: No categories available. Please add some.
ar: لا توجد فئات متاحة. يرجى إضافة بعض.

# filterCategory
source: Filter by Category
ar: تصفية حسب الفئة

source: All Categories
ar: جميع الفئات

source: No products found matching filters.
ar: لم يتم العثور على منتجات مطابقة للمرشحات.

# areaAddedSuccessfully
source: Area "{areaName}" added successfully!
ar: تمت إضافة المنطقة "{areaName}" بنجاح!

# failedToAddArea
source: Failed to add area: {error}
ar: فشل إضافة المنطقة: {error}

# areaDeleted
source: Area "{areaName}" deleted.
ar: تم حذف المنطقة "{areaName}".

# failedToDeleteArea
source: Failed to delete area: {error}
ar: فشل حذف المنطقة: {error}

# noShippingAreasFound
source: No shipping areas found. Add some above.
ar: لم يتم العثور على مناطق شحن. أضف بعضها أعلاه.

source: Update Order Status
ar: تحديث حالة الطلب

source: New Status
ar: الحالة الجديدة

# orderStatusUpdated
source: Order {orderId} status updated to "{newStatus}"!
ar: تم تحديث حالة الطلب {orderId} إلى "{newStatus}"!

# failedToUpdateOrderStatus
source: Failed to update order status: {error}
ar: فشل تحديث حالة الطلب: {error}

# couldNotLaunchDialer
source: Could not launch dialer for {phoneNumber}. Make sure a dialer app is installed.
ar: تعذر تشغيل برنامج الاتصال لـ {phoneNumber}. تأكد من تثبيت تطبيق الاتصال.

source: Phone number not available.
ar: رقم الهاتف غير متاح.

# noOrderDataAvailable
source: No order data available for analytics.
ar: لا توجد بيانات طلب متاحة للتحليلات.

source: Dashboard Analytics
ar: تحليلات لوحة التحكم

# changePasswordComingSoon
source: Change Password functionality (coming soon)!
ar: وظيفة تغيير كلمة المرور (قريبًا)!

source: Version
ar: الإصدار

# aboutUsContent
source: Bubbles E-commerce is your one-stop shop for quality products at affordable prices. We are committed to providing excellent customer service and a seamless shopping experience.
ar: تطبيق فقاعات للتجارة الإلكترونية هو وجهتك الوحيدة للمنتجات عالية الجودة بأسعار معقولة. نحن ملتزمون بتقديم خدمة عملاء ممتازة وتجربة تسوق سلسة.

source: Logout
ar: تسجيل الخروج

source: Access Denied
ar: تم رفض الوصول

source: Verifying admin access...
ar: جاري التحقق من صلاحيات المسؤول...

# notAuthorizedToViewAdminPanel
source: You are not authorized to view the admin panel.
ar: أنت غير مصرح لك بمشاهدة لوحة تحكم المسؤول.

source: Back to Home
ar: العودة إلى الصفحة الرئيسية

# addProductTabTitle
source: Add Product
ar: إضافة منتج

# manageOfferCodesTitle
source: Manage Offer Codes
ar: إدارة أكواد العروض

source: Failed to load previous address details
ar: فشل تحميل تفاصيل العنوان السابق

# pleaseEnterPhoneNumber
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك

# pleaseEnterValidEgyptianPhoneNumber
source: Please enter a valid Egyptian phone number
ar: الرجاء إدخال رقم هاتف مصري صحيح

source: Please enter {fieldName}
ar: الرجاء إدخال {fieldName}

source: Please select shipping area
ar: الرجاء اختيار منطقة الشحن

source: Basket is empty, cannot checkout
ar: السلة فارغة، لا يمكن الدفع

source: Select Payment Method
ar: اختر طريقة الدفع

source: Cash on Delivery
ar: الدفع عند الاستلام

source: Vodafone Cash
ar: فودافون كاش

source: Etisalat Cash
ar: اتصالات كاش

source: We Cash
ar: وي كاش

source: Instapay
ar: إنستاباي

# paymentInstruction
source: Choose your preferred payment method
ar: اختر طريقة الدفع المفضلة لديك

source: Processing Order
ar: جاري معالجة الطلب

source: Today
ar: اليوم

source: Tomorrow
ar: غدًا

source: Shipping Information
ar: معلومات الشحن

source: Order Summary
ar: ملخص الطلب

source: Estimated Delivery
ar: تاريخ التسليم المقدر

source: Free Shipping
ar: شحن مجاني

source: Apply Offer Code
ar: تطبيق رمز العرض

# offerCodeAddedSuccessfully
source: Offer code {code} added successfully
ar: تمت إضافة رمز العرض {code} بنجاح

# basketIsEmpty
source: Your basket is empty
ar: سلة المشتريات فارغة

# addProductsToGetStarted
source: Add some products to get started
ar: أضف بعض المنتجات للبدء

source: Clear Basket
ar: مسح السلة

# clearBasketConfirmTitle
source: Clear Basket
ar: مسح السلة

# clearBasketConfirmContent
source: Are you sure you want to clear your basket?
ar: هل أنت متأكد أنك تريد مسح سلة المشتريات الخاصة بك؟

source: Clear
ar: مسح

source: Basket cleared
ar: تم مسح السلة

source: Remove Product
ar: إزالة المنتج

source: Proceed to Checkout
ar: المتابعة إلى الدفع

source: Loading products...
ar: جاري تحميل المنتجات...

source: Error loading products
ar: خطأ في تحميل المنتجات

source: Products in
ar: منتجات في

source: Check back later
ar: تحقق لاحقًا

# noProductsInCategory
source: No products found in {category}
ar: لا توجد منتجات في فئة {category}

source: Confirm Order
ar: تأكيد الطلب

# orderTotal
source: Order Total: EGP {total}
ar: إجمالي الطلب: {total} جنيه مصري

source: Delivery to
ar: التوصيل إلى

# areYouSureWantToPlaceOrder
source: Are you sure you want to place this order?
ar: هل أنت متأكد أنك تريد تقديم هذا الطلب؟

source: Confirm
ar: تأكيد

source: User not logged in to place order
ar: المستخدم غير مسجل الدخول لتقديم الطلب

# productDoesNotExistInInventory
source: Product {name} does not exist in inventory
ar: المنتج {name} غير موجود في المخزون

# notEnoughStock
source: Not enough stock for {name}. Available: {available}, Requested: {requested}
ar: لا يوجد مخزون كافٍ لـ {name}. المتاح: {available}، المطلوب: {requested}

# failedToPlaceOrder
source: Failed to place order: {error}
ar: فشل في تقديم الطلب: {error}

# couldNotLaunchUrl
source: Could not launch URL: {url}
ar: تعذر تشغيل الرابط: {url}

# paymentDialerPrompt
source: Dial {code} to pay EGP {amount}
ar: اطلب {code} لدفع {amount} جنيه مصري

source: OK
ar: موافق

source: Try Again
ar: حاول مرة أخرى

source: Items Ordered
ar: العناصر المطلوبة

source: WhatsApp Us
ar: راسلنا واتساب

source: Call Us
ar: اتصل بنا

source: Need Assistance?
ar: هل تحتاج مساعدة؟

# supportTeamHelp
source: Our support team is here to help you
ar: فريق الدعم لدينا هنا لمساعدتك

# availableBusinessHours
source: Available during business hours: 9 AM - 6 PM
ar: متاح خلال ساعات العمل: 9 صباحًا - 6 مساءً

# failedToCancelOrder
source: Failed to cancel order: {error}
ar: فشل إلغاء الطلب: {error}

source: Edit Profile
ar: تعديل الملف الشخصي

# fieldNameMustBeNumber
source: {fieldName} must be a number
ar: {fieldName} يجب أن يكون رقمًا

# errorLoadingCategories
source: Error loading categories: {error}
ar: خطأ في تحميل الفئات: {error}

source: Search products to add
ar: ابحث عن المنتجات لإضافتها

source: Search product by name
ar: ابحث عن المنتج بالاسم

source: Selected Related Products
ar: المنتجات ذات الصلة المختارة

# items
source: {count} items
ar: {count} عناصر

source: Unnamed Product
ar: منتج بدون اسم

source: No other related products found
ar: لم يتم العثور على منتجات أخرى ذات صلة

source: Mark as Offer
ar: ضع كعرض

# pleaseLoginToViewOrders
source: Please login to view your orders
ar: الرجاء تسجيل الدخول لعرض طلباتك

# itemRemoved
source: Item {name} removed
ar: تمت إزالة العنصر {name}

# basketEmptyCannotCheckout
source: Basket is empty, cannot checkout
ar: السلة فارغة، لا يمكن الدفع

# yesterdayAt
source: Yesterday at {hour}:{minute}
ar: أمس في {hour}:{minute}

# todayAt
source: Today at {hour}:{minute}
ar: اليوم في {hour}:{minute}

source: at
ar: في

source: Mon
ar: الاثنين

source: Tue
ar: الثلاثاء

source: Wed
ar: الأربعاء

source: Thu
ar: الخميس

source: Fri
ar: الجمعة

source: Sat
ar: السبت

source: Sun
ar: الأحد

# itemCount
source: {count} items
ar: {count} عناصر

source: Discount Percentage
ar: نسبة الخصم

source: Add Offer Code
ar: إضافة رمز عرض

# offerCodeRequired
source: Offer code is required
ar: رمز العرض مطلوب

# failedToAddOfferCode
source: Failed to add offer code: {error}
ar: فشل إضافة رمز العرض: {error}

# offerCodeRemoved
source: Offer code {code} removed
ar: تمت إزالة رمز العرض {code}

# failedToRemoveOfferCode
source: Failed to remove offer code: {error}
ar: فشل إزالة رمز العرض: {error}

source: No offer codes found
ar: لم يتم العثور على رموز عروض

# egyptianMobileNumberHint
source: Egyptian mobile number (11 digits)
ar: رقم جوال مصري (11 رقمًا)

source: Payment Method
ar: طريقة الدفع

source: Offer Code
ar: رمز العرض

source: Category
ar: الفئة

source: Offer
ar: عرض

source: Yes
ar: نعم

source: No
ar: لا

# notAvailableAbbreviation
source: N/A
ar: غير متاح

source: Clear Filters
ar: مسح المرشحات

source: No categories available for filtering
ar: لا توجد فئات متاحة للتصفية

# noProductsFoundSimple
source: No products found
ar: لم يتم العثور على منتجات

# productDeletedSuccessfully
source: Product {productName} deleted successfully
ar: تم حذف المنتج {productName} بنجاح

# failedToDeleteProduct
source: Failed to delete product: {error}
ar: فشل حذف المنتج: {error}

# areYouSureDeleteProductAdmin
source: Are you sure you want to delete "{productName}"? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف "{productName}"؟ لا يمكن التراجع عن هذا الإجراء.

source: Edit Product
ar: تعديل المنتج

# pleaseSelectCategory
source: Please select a category
ar: الرجاء اختيار فئة

source: Product updated successfully
ar: تم تحديث المنتج بنجاح

# failedToUpdateProduct
source: Failed to update product: {error}
ar: فشل تحديث المنتج: {error}

source: Price and quantity cannot be negative
ar: لا يمكن أن يكون السعر والكمية سالبة

# failedToSearchProducts
source: Failed to search products: {error}
ar: فشل البحث عن المنتجات: {error}

source: No related products found
ar: لم يتم العثور على منتجات ذات صلة

source: No shipping areas available
ar: لا توجد مناطق شحن متاحة

# orderItems
source: {count} items ordered
ar: {count} عناصر مطلوبة

source: Filter by Category
ar: تصفية حسب الفئة

source: Select Shipping Area
ar: اختر منطقة الشحن

# noProductsFoundGeneral
source: No products found
ar: لم يتم العثور على منتجات

# storeLocationTitle
source: Store Location
ar: موقع المتجر

# nearbyShopsTitle
source: Nearby Shops
ar: المتاجر القريبة

# petAdoptionTitle
source: Pet Adoption
ar: تبني الحيوانات الأليفة

source: Find Your Perfect Companion
ar: اعثر على رفيقك المثالي

source: Loving pets looking for homes
ar: حيوانات أليفة محبة تبحث عن منازل

source: Visit Our Physical Store
ar: قم بزيارة متجرنا الفعلي

source: Store Information
ar: معلومات المتجر

source: Address
ar: العنوان

source: Phone
ar: الهاتف

source: Operating Hours
ar: ساعات العمل

source: Find Us on Map
ar: اعثر علينا على الخريطة

source: Interactive Map
ar: خريطة تفاعلية

# clickButtonsBelowToOpen
source: Click buttons below to open in Google Maps
ar: انقر على الأزرار أدناه للفتح في خرائط جوجل

source: Open in Maps
ar: فتح في الخرائط

source: Get Directions
ar: احصل على الاتجاهات

source: Call Store
ar: اتصل بالمتجر

source: Store Features
ar: مميزات المتجر

source: Discover Local Businesses
ar: اكتشف الأعمال المحلية

source: Support your local community
ar: ادعم مجتمعك المحلي

source: Nearby shops updated
ar: تم تحديث المتاجر القريبة

source: Call
ar: اتصال

source: Browse Pets
ar: تصفح الحيوانات الأليفة

source: Post Ad
ar: نشر إعلان

source: Post Pet for Adoption
ar: نشر حيوان أليف للتبني

# helpPetFindLovingHome
source: Help a pet find a loving home
ar: ساعد حيوان أليف في العثور على منزل محب

source: Add Photos
ar: إضافة صور

source: Pet Information
ar: معلومات الحيوان الأليف

source: Pet Name
ar: اسم الحيوان الأليف

source: Pet Type
ar: نوع الحيوان الأليف

source: Gender
ar: الجنس

source: Age
ar: العمر

source: Breed
ar: السلالة

source: Health Information
ar: المعلومات الصحية

source: Vaccinated
ar: مطعم

source: Spayed/Neutered
ar: معقم/مخصي

source: Contact Information
ar: معلومات الاتصال

source: Your Name
ar: اسمك

source: Your Phone Number
ar: رقم هاتفك

# postPetForAdoptionButton
source: Post Pet for Adoption
ar: نشر حيوان أليف للتبني

source: Posting...
ar: جاري النشر...

source: Contact
ar: اتصال

source: Please enter pet name
ar: يرجى إدخال اسم الحيوان الأليف

source: Please enter age
ar: يرجى إدخال العمر

source: Please enter description
ar: يرجى إدخال الوصف

source: Please enter your name
ar: يرجى إدخال اسمك

source: Please add at least one photo
ar: يرجى إضافة صورة واحدة على الأقل

source: Pet ad posted successfully!
ar: تم نشر إعلان الحيوان الأليف بنجاح!

# errorPostingAd
source: Error posting ad: {error}
ar: خطأ في نشر الإعلان: {error}

source: No pets available for adoption
ar: لا توجد حيوانات أليفة متاحة للتبني

# beFirstToPostPet
source: Be the first to post a pet for adoption!
ar: كن أول من ينشر حيوان أليف للتبني!

source: Error loading pets
ar: خطأ في تحميل الحيوانات الأليفة

source: Product Details
ar: تفاصيل المنتج

# wishlistTitle
source: My Wishlist
ar: قائمة الأمنيات

# supportSmallBusinessTitle
source: Support Small Businesses
ar: دعم الأعمال الصغيرة

# manageNearbyShopsTitle
source: Nearby Shops
ar: المتاجر القريبة

# manageAppFeaturesTitle
source: App Features
ar: ميزات التطبيق

source: App Features Management
ar: إدارة ميزات التطبيق

# controlWhichFeaturesVisible
source: Control which features are visible to customers
ar: تحكم في الميزات المرئية للعملاء

# supportSmallBusinessScreen
source: Support Small Businesses Screen
ar: شاشة دعم الأعمال الصغيرة

# toggleVisibilityDescription
source: Toggle the visibility of the Support Small Businesses section in the customer app drawer
ar: تبديل رؤية قسم دعم الأعمال الصغيرة في درج التطبيق للعملاء

source: Feature is ENABLED
ar: الميزة مُفعلة

source: Feature is DISABLED
ar: الميزة مُعطلة

# customersCanSeeThisScreen
source: Customers can see this screen in the app drawer
ar: يمكن للعملاء رؤية هذه الشاشة في درج التطبيق

# thisScreenIsHidden
source: This screen is hidden from customers
ar: هذه الشاشة مخفية عن العملاء

source: Customization Options
ar: خيارات التخصيص

source: Menu Title
ar: عنوان القائمة

source: Menu Icon
ar: أيقونة القائمة

source: Preview in App Drawer
ar: معاينة في درج التطبيق

source: Save Feature Settings
ar: حفظ إعدادات الميزة

source: Saving...
ar: جاري الحفظ...

source: Feature settings saved successfully!
ar: تم حفظ إعدادات الميزة بنجاح!

source: How it works
ar: كيف يعمل

# howItWorksDescription
source: • When enabled, customers will see the menu item in their app drawer • When disabled, the menu item is completely hidden • Changes take effect immediately for all users • You can customize the title and icon anytime • Use the "Shops" tab to add businesses to this section
ar: • عند التفعيل، سيرى العملاء عنصر القائمة في درج التطبيق • عند التعطيل، يتم إخفاء عنصر القائمة تمامًا • التغييرات تسري على الفور لجميع المستخدمين • يمكنك تخصيص العنوان والأيقونة في أي وقت • استخدم تبويب "المتاجر" لإضافة أعمال إلى هذا القسم

source: Add New Shop
ar: إضافة متجر جديد

# chooseDestinationAndAddDetails
source: Choose destination and add shop details
ar: اختر الوجهة وأضف تفاصيل المتجر

source: Add to Collection:
ar: أضف إلى المجموعة:

# shopImagesMultiple
source: Shop Images * (You can select multiple images)
ar: صور المتجر * (يمكنك اختيار صور متعددة)

source: Tap to select shop images
ar: اضغط لاختيار صور المتجر

source: You can select multiple images
ar: يمكنك اختيار صور متعددة

source: Add More
ar: أضف المزيد

# shopNameRequired
source: Shop Name *
ar: اسم المتجر *

source: Please enter shop name
ar: يرجى إدخال اسم المتجر

# categoryRequired
source: Category *
ar: الفئة *

source: Categories for nearby shops
ar: فئات للمتاجر القريبة

source: Categories for small businesses
ar: فئات للأعمال الصغيرة

source: Floor
ar: الطابق

source: Ground Floor
ar: الطابق الأرضي

# tellCustomersAboutShop
source: Tell customers about this shop...
ar: أخبر العملاء عن هذا المتجر...

# tellCustomersAboutBusiness
source: Tell customers about this business...
ar: أخبر العملاء عن هذا العمل...

source: Add to Nearby Shops
ar: أضف إلى المتاجر القريبة

source: Add to Support Small Businesses
ar: أضف إلى دعم الأعمال الصغيرة

source: Adding...
ar: جاري الإضافة...

source: Shop added successfully!
ar: تمت إضافة المتجر بنجاح!

source: Business added successfully!
ar: تمت إضافة العمل بنجاح!

# pleaseSelectAtLeastOneImage
source: Please select at least one image for the shop
ar: يرجى اختيار صورة واحدة على الأقل للمتجر

source: Manage Shops
ar: إدارة المتاجر

# editActivateOrRemoveShops
source: Edit, activate, or remove shops from collections
ar: تعديل أو تفعيل أو إزالة المتاجر من المجموعات

source: No shops in {collection} yet
ar: لا توجد متاجر في {collection} بعد

# addYourFirstShop
source: Add your first shop using the "Add Shop" tab!
ar: أضف متجرك الأول باستخدام تبويب "إضافة متجر"!

# images
source: {count} images
ar: {count} صور

# floorLabel
source: Floor: {floor}
ar: الطابق: {floor}

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: Activate
ar: تفعيل

source: Deactivate
ar: إلغاء التفعيل

source: Delete Shop
ar: حذف المتجر

# areYouSureDeleteShop
source: Are you sure you want to delete "{shopName}"?
ar: هل أنت متأكد أنك تريد حذف "{shopName}"؟

source: Shop deleted successfully
ar: تم حذف المتجر بنجاح

source: Shop activated
ar: تم تفعيل المتجر

source: Shop deactivated
ar: تم إلغاء تفعيل المتجر

# errorUpdatingShop
source: Error updating shop: {error}
ar: خطأ في تحديث المتجر: {error}

# errorDeletingShop
source: Error deleting shop: {error}
ar: خطأ في حذف المتجر: {error}

source: Error loading shops
ar: خطأ في تحميل المتاجر

source: Could not launch phone dialer
ar: تعذر تشغيل برنامج الاتصال
