Repository: mekobeko2222/bubbles-ecommerce-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# errorLaunchingDialer
source: Error launching dialer: {error}
ar: خطأ في تشغيل برنامج الاتصال: {error}

source: Support Local Entrepreneurs
ar: ادعم رواد الأعمال المحليين

# helpSmallBusinessesThrive
source: Help small businesses thrive in your community
ar: ساعد الأعمال الصغيرة على الازدهار في مجتمعك

source: Loading businesses...
ar: جاري تحميل الأعمال...

source: Error loading businesses
ar: خطأ في تحميل الأعمال

source: No small businesses available
ar: لا توجد أعمال صغيرة متاحة

# checkBackLaterForEntrepreneurs
source: Check back later for local entrepreneurs!
ar: تحقق لاحقًا من رواد الأعمال المحليين!

source: Small businesses updated
ar: تم تحديث الأعمال الصغيرة

source: Removed from wishlist
ar: تمت الإزالة من قائمة الأمنيات

source: Added to wishlist
ar: تمت الإضافة إلى قائمة الأمنيات

source: Handmade
ar: الأعمال اليدوية

# artAndCrafts
source: Art & Crafts
ar: الفن والحرف

# foodAndBeverage
source: Food & Beverage
ar: الطعام والمشروبات

source: Services
ar: الخدمات

source: Technology
ar: التكنولوجيا

source: Consulting
ar: الاستشارات

source: Retail
ar: التجارة بالتجزئة

# fitnessAndWellness
source: Fitness & Wellness
ar: اللياقة والعافية

source: Education
ar: التعليم

source: Other
ar: أخرى

source: Business
ar: عمل

source: Heart
ar: قلب

source: Handshake
ar: مصافحة

source: Support
ar: دعم

source: Volunteer
ar: تطوع

source: Group
ar: مجموعة

source: Store
ar: متجر

# errorLoadingSettings
source: Error loading settings: {error}
ar: خطأ في تحميل الإعدادات: {error}

# errorSavingSettings
source: Error saving settings: {error}
ar: خطأ في حفظ الإعدادات: {error}

source: Loading feature settings...
ar: جاري تحميل إعدادات الميزة...

source: Failed to upload images
ar: فشل تحميل الصور

# errorAddingShop
source: Error adding shop: {error}
ar: خطأ في إضافة المتجر: {error}

source: Nearby Shops
ar: المتاجر القريبة

source: My Wishlist
ar: قائمة أمنياتي

source: Pet Adoption
ar: تبني الحيوانات الأليفة
